import { News } from '@/types/entities/news'

const date = '2024-06-11T00:00'

export const TempNews: News[] = [
  {
    _id: '1',
    image: '/temp/news/1.png',
    title: 'Альтернативные технологии производства печатных плат',
    text: 'Сегодня мы продолжим препарировать альтернативные технологии производства печатных плат, так как любая эволюция, будь то человеческого общества или технических процессов это определённый путь, со множеством видоизменений, в ходе которого рассмотрение даже самых невероятных вариантов может быть интересным (потенциально дать новое ответвление полезного применения технологии).',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '2',
    image: '/temp/news/2.png',
    title:
      'Computex 2024 с места событий: новые процессоры Intel Xeon 6700E, AMD EPYC Turin и другие новинки',
    text: 'На острове Тайвань в городе Тайбэй продолжается конференция Computex 2024 — одно из самых значимых событий в мире технологий, на котором собираются ведущие производители электроники. Свои продукты представляют такие гиганты, как Intel, AMD и Nvidia.\nМеня зовут Сергей, я менеджер выделенных серверов в Selectel. Посетил конференцию и хочу поделиться инсайтами, рассказать о представленных новинках. Приготовьтесь, будет интересно, а еще — много фото. Подробности под катом!',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '3',
    image: '/temp/news/3.png',
    title:
      'Встроили в шрифт микротипограф, который сам ставит правильные тире, кавычки и не только',
    text: 'Многие дизайнеры (и не только они) знают, чем тире отличается от дефиса, а типографские кавычки от программистских — об этом заботятся в том числе правила грамматики, справочник Мильчина и книги по типографике. В личной переписке это не важно, а вот в публикациях, на сайтах и т. д. соблюдение правил микротипографики придаёт тексту более профессиональный вид.\nПроблема в том, что «правильные» типографские знаки не входят в ASCII и не всегда удобно набираются с клавиатуры. Например, в Windows набрать тире или кавычки можно только на клавиатуре, у которой справа есть numpad, или в Ворде с помощью юникодных номеров и Alt + x, или если установить типографскую клавиатурную раскладку Ильи Бирмана. ',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '4',
    image: '/temp/news/1.png',
    title: 'Альтернативные технологии производства печатных плат',
    text: 'Сегодня мы продолжим препарировать альтернативные технологии производства печатных плат, так как любая эволюция, будь то человеческого общества или технических процессов это определённый путь, со множеством видоизменений, в ходе которого рассмотрение даже самых невероятных вариантов может быть интересным (потенциально дать новое ответвление полезного применения технологии).',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '5',
    image: '/temp/news/2.png',
    title:
      'Computex 2024 с места событий: новые процессоры Intel Xeon 6700E, AMD EPYC Turin и другие новинки',
    text: 'На острове Тайвань в городе Тайбэй продолжается конференция Computex 2024 — одно из самых значимых событий в мире технологий, на котором собираются ведущие производители электроники. Свои продукты представляют такие гиганты, как Intel, AMD и Nvidia.\nМеня зовут Сергей, я менеджер выделенных серверов в Selectel. Посетил конференцию и хочу поделиться инсайтами, рассказать о представленных новинках. Приготовьтесь, будет интересно, а еще — много фото. Подробности под катом!',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '6',
    image: '/temp/news/3.png',
    title:
      'Встроили в шрифт микротипограф, который сам ставит правильные тире, кавычки и не только',
    text: 'Многие дизайнеры (и не только они) знают, чем тире отличается от дефиса, а типографские кавычки от программистских — об этом заботятся в том числе правила грамматики, справочник Мильчина и книги по типографике. В личной переписке это не важно, а вот в публикациях, на сайтах и т. д. соблюдение правил микротипографики придаёт тексту более профессиональный вид.\nПроблема в том, что «правильные» типографские знаки не входят в ASCII и не всегда удобно набираются с клавиатуры. Например, в Windows набрать тире или кавычки можно только на клавиатуре, у которой справа есть numpad, или в Ворде с помощью юникодных номеров и Alt + x, или если установить типографскую клавиатурную раскладку Ильи Бирмана. ',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '7',
    image: '/temp/news/1.png',
    title: 'Альтернативные технологии производства печатных плат',
    text: 'Сегодня мы продолжим препарировать альтернативные технологии производства печатных плат, так как любая эволюция, будь то человеческого общества или технических процессов это определённый путь, со множеством видоизменений, в ходе которого рассмотрение даже самых невероятных вариантов может быть интересным (потенциально дать новое ответвление полезного применения технологии).',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '8',
    image: '/temp/news/2.png',
    title:
      'Computex 2024 с места событий: новые процессоры Intel Xeon 6700E, AMD EPYC Turin и другие новинки',
    text: 'На острове Тайвань в городе Тайбэй продолжается конференция Computex 2024 — одно из самых значимых событий в мире технологий, на котором собираются ведущие производители электроники. Свои продукты представляют такие гиганты, как Intel, AMD и Nvidia.\nМеня зовут Сергей, я менеджер выделенных серверов в Selectel. Посетил конференцию и хочу поделиться инсайтами, рассказать о представленных новинках. Приготовьтесь, будет интересно, а еще — много фото. Подробности под катом!',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '9',
    image: '/temp/news/3.png',
    title:
      'Встроили в шрифт микротипограф, который сам ставит правильные тире, кавычки и не только',
    text: 'Многие дизайнеры (и не только они) знают, чем тире отличается от дефиса, а типографские кавычки от программистских — об этом заботятся в том числе правила грамматики, справочник Мильчина и книги по типографике. В личной переписке это не важно, а вот в публикациях, на сайтах и т. д. соблюдение правил микротипографики придаёт тексту более профессиональный вид.\nПроблема в том, что «правильные» типографские знаки не входят в ASCII и не всегда удобно набираются с клавиатуры. Например, в Windows набрать тире или кавычки можно только на клавиатуре, у которой справа есть numpad, или в Ворде с помощью юникодных номеров и Alt + x, или если установить типографскую клавиатурную раскладку Ильи Бирмана. ',
    source: '',
    is_parsed: false,
    created_at: date,
  },
  {
    _id: '10',
    image: '/temp/news/1.png',
    title: 'Альтернативные технологии производства печатных плат',
    text: 'Сегодня мы продолжим препарировать альтернативные технологии производства печатных плат, так как любая эволюция, будь то человеческого общества или технических процессов это определённый путь, со множеством видоизменений, в ходе которого рассмотрение даже самых невероятных вариантов может быть интересным (потенциально дать новое ответвление полезного применения технологии).',
    source: '',
    is_parsed: false,
    created_at: date,
  },
]
